literate/30-edit.org
#+OPTIONS: :toc 2
#+DESCRIPTION: Configuration for Edit
#+DATE: 2025-06-04 00:19:20
#+AUTHOR: mistertuna93
#+TITLE: Edit
#+PROPERTY: header-args:emacs-lisp :tangle ../elisp/30-editing.el
#+TAGS[]: emacs config editing
#+ALIASES[]: /.emacs.default/03-editing.html

* Smart Editing
** expand-region
#+begin_src emacs-lisp
(use-package expand-region
  :ensure t
  :bind ("C-=" . er/expand-region))
#+end_src

** smartparens
#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :hook (prog-mode . smartparens-mode)
  :config
  (require 'smartparens-config))
#+end_src

** hungry-delete
#+begin_src emacs-lisp
(use-package hungry-delete
  :ensure t
  :config
  (global-hungry-delete-mode))
#+end_src

* Undo System
** undo-fu
#+begin_src emacs-lisp
(use-package undo-fu
  :ensure t
  :config
  (setq undo-limit 800000
        undo-strong-limit 12000000
        undo-outer-limit 120000000))
#+end_src

* Commenting
** comment-dwim-2
#+begin_src emacs-lisp
(use-package comment-dwim-2
  :ensure t
  :bind ("M-;" . comment-dwim-2))
#+end_src

* Indentation Guides
** highlight-indent-guides
#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :ensure t
  :hook (prog-mode . highlight-indent-guides-mode)
  :init
  (setq highlight-indent-guides-method 'character))
#+end_src

* Visual Feedback for Editing
** rainbow-mode
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :hook (prog-mode . rainbow-mode))
#+end_src

** color-identifiers-mode
#+begin_src emacs-lisp
(use-package color-identifiers-mode
  :ensure t
  :hook (prog-mode . color-identifiers-mode))
#+end_src

* Navigation Helpers
** avy
#+begin_src emacs-lisp
(use-package avy
  :ensure t
  :bind
  ("M-s" . avy-goto-char)
  ("M-g f" . avy-goto-line))
#+end_src

* Whitespace Cleanup
** ws-butler
#+begin_src emacs-lisp
(use-package ws-butler
  :ensure t
  :hook ((prog-mode text-mode) . ws-butler-mode))
#+end_src
